p = int(input('Enter p: '))         #Введення p
q = int(input('Enter q: '))         #Введення q

n = p/2                             #Обчислення максимального дільника p, не рівного p
n = round(n)

print('Result: ', end = " ")

for i in range(n):                  #Початок арифметичного циклу
    x = q                           #Введення допоміжних змінних
    y = i + 1
    if p%y==0:                      #Умова перевірки, чи є число дільником p
        while x!=y:                 #Цикл знаходження найбільшого спільного дільника
            if x>y:
                x-=y
            else:
                y-=x
        if x==1:                    #Умова перевірки, чи є числа q та i взаємно простими
            print(i+1,end = " ")    #Виведення результату

print()
input('Press ENTER to exit')        #Завершення програми