#include <iostream>

using namespace std;

int main() {
  int p, q, i, x, y, n;

  cout << "Enter p: "; cin >> p;    //Введення p
  cout << "Enter q: "; cin >> q;    //Введення q

  n = p / 2;                        //Обчислення максимального дільника p, не рівного p

  cout << "Result: ";

  for (i=1;i<=n;i++){               //Початок арифметичного циклу
      if (p%i==0){                  //Умова перевірки, чи є число дільником p
        x = q;                      //Введення допоміжних змінних
        y = i; 
        while (x != y) {            //Цикл знаходження найбільшого спільного дільника
            if (x > y) {
                x = x-y;
            } else {
                y = y-x;
            }
        }
        if (x==1){                  //Умова перевірки, чи є числа q та i взаємно простими
            cout << i << " ";       //Виведення результату
        }
      }
  }

  cout << endl;

  system("pause");                  //Завершення програми
}