#include <iostream>
#include <cmath>

using namespace std;

float e;                                    //Об'явлення глобальної змінної(точність)

//Прототипи функцій
float Ln(float,float);                      //Функція обчислення натурального логарифму
void Solution();                            //Функція, яка проводить розв'язок задачі
void Browse(float, float);                  //Функція, яка виводить результат

int main(){
    cout << "Enter e: "; cin >> e;          //Введення точності
    Solution();                             //Розв'язок задачі
}

float Ln(float x, float E){          
    float a2 = -pow(x-1,2)/2, a1 = x-1;     //Знаходження перших двох елементів у ряді Тейлора(ряд Тейлора в умові вказаний невірно, перед парними елементами мінус)
    float S = a1 + a2;                      //Додавання перших двох елементів у суму(результат підпрограми)
    int j = 2;
    while (abs(a2)>E){                      //За умовою, поки останній елемент за модулем більший за точність, проводимо ітерацію
        j++;
        a1 = a2;                            //Поточний елемент з попередньої ітерації стає попереднім
        a2 = pow(-1,j-1) * pow(x-1,j)/j;    //Новий поточний елемент рахується за рекурентною формулою
        S += a2;                            //Додавання поточного елемента у суму
    }
    return S;                               //Повернення результату
}

void Browse(float l, float Rez){
    cout << "y(" << l << ") = " << Rez << endl;
}

void Solution(){
    float rez;
    for (float i = 1; i <= 3; i+=0.5)       //Починаємо перелічувати x від 0 до 3(Нуль не враховується за умовою задачі)
    {
        if (i<=2)
            rez = Ln(i*i/2,e);              //Результат для x від 1 до 2( Ln(x)+Ln(x/2)=Ln(x * x/2) )
        else
            rez = Ln(i/2-1,e);              //Результат для x від 2.5 до 3(за умовою задачі 2 треба віднести сюди, але тоді вийде Ln(0))
        Browse(i,rez);                      //Вивід результату
    }
}



